#+TITLE: Working through Sedgwick's Algorithms for Rubyists in Emacs
#+AUTHOR: Dmitri G. Brengauz

:PROPERTIES:
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>

#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/jquery-1.11.0.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/jquery-ui-1.10.2.min.js"></script>

#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/jquery.localscroll-min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/jquery.scrollTo-1.4.3.1-min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/jquery.zclip.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/bigblow.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/hideshow.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.min.js"></script>
:END:

***** Running Projece code
      :PROPERTIES:
      :EXPORT_OPTIONS: both
      :DIR: ~/repos/learnin/algorithms
      :FORMAT: raw
      :END:
    :PROPERTIES:
    :dir ~/repos/learnin/algorithms/
    :exports both
    :END:
      #+BEGIN_SRC sh
        mvn exec:java -Dexec.mainClass="org.momus.algorithms.HelloWorld" \
        | grep -v INFO

        mvn exec:java -Dexec.mainClass="org.momus.algorithms.EuclidsGCD" \
        -Dexec.args="24 58" | grep -v INFO
      #+END_SRC

      #+RESULTS:
      | ยก | Hola | Mundo | ! |
      | 2 |      |       |   |

*** TODO Programing Assignment
    :PROPERTIES:
    :END:
    #+BEGIN_SRC sh  :results value verbatim
      mvn exec:java -Dexec.mainClass="org.momus.algorithms.PercolationStats"  -Dexec.args="40  100" | grep -v INFO
    #+END_SRC

    #+RESULTS:
    : mean                    = 0.5907312499999999
    : stddev                  = 0.030889978551900434
    : 95% confidence interval = 0.5846768142038274, 0.5967856857961724
 
***  Testing
    #+BEGIN_SRC sh :results verbatim
      mvn -f /home/kwaku/repos/learnin/algorithms/pom.xml  test | grep -v INFO
    #+END_SRC

    #+RESULTS:
    #+begin_example

    -------------------------------------------------------
     T E S T S
    -------------------------------------------------------
    Running org.momus.algorithms.PercolationTest
    Tests run: 1, Failures: 0, Errors: 0, Skipped: 0, Time elapsed: 6.481 sec
    Running org.momus.algorithms.AppTest
    Tests run: 1, Failures: 0, Errors: 0, Skipped: 0, Time elapsed: 0 sec
    Running org.momus.algorithms.PercolationStatsTest
    Tests run: 1, Failures: 0, Errors: 0, Skipped: 0, Time elapsed: 0 sec
    Running org.momus.algorithms.EuclidsGCDTest
    Tests run: 1, Failures: 0, Errors: 0, Skipped: 0, Time elapsed: 0 sec

    Results :

    Tests run: 4, Failures: 0, Errors: 0, Skipped: 0

#+end_example
 




